In [64]:
import numpy as np
import pandas as pd

In [65]:
#9.i

employees = [
        {"empid":1,"Name":"Pavan"},
        {"empid":2,"Name":"Sanjay"},
        {"empid":3,"Name":"Deeksha"},
        {"empid":4,"Name":"Kaushal"},
        {"empid":5,"Name":"Rucha"},
        {"empid":6,"Name":"plm"},
        {"empid":7,"Name":"uhb"},
        {"empid":8,"Name":"rdc"},
        {"empid":9,"Name":"esz"},
        {"empid":10,"Name":"bhi"}
]
for emp in employees:
    print(emp)
print(f"Type = {type(employees)}")

{'empid': 1, 'Name': 'Pavan'}
{'empid': 2, 'Name': 'Sanjay'}
{'empid': 3, 'Name': 'Deeksha'}
{'empid': 4, 'Name': 'Kaushal'}
{'empid': 5, 'Name': 'Rucha'}
{'empid': 6, 'Name': 'plm'}
{'empid': 7, 'Name': 'uhb'}
{'empid': 8, 'Name': 'rdc'}
{'empid': 9, 'Name': 'esz'}
{'empid': 10, 'Name': 'bhi'}
Type = <class 'list'>

In [66]:
#9.ii
p_series = pd.Series(employees)
print(p_series)
#9.iii
print(f"Type = {(p_series).dtype}")

0      {'empid': 1, 'Name': 'Pavan'}
1     {'empid': 2, 'Name': 'Sanjay'}
2    {'empid': 3, 'Name': 'Deeksha'}
3    {'empid': 4, 'Name': 'Kaushal'}
4      {'empid': 5, 'Name': 'Rucha'}
5        {'empid': 6, 'Name': 'plm'}
6        {'empid': 7, 'Name': 'uhb'}
7        {'empid': 8, 'Name': 'rdc'}
8        {'empid': 9, 'Name': 'esz'}
9       {'empid': 10, 'Name': 'bhi'}
dtype: object
Type = object

In [76]:
#9.iv
df = pd.DataFrame(employees)

In [77]:
#9.v.a
print(df)

   empid     Name
0      1    Pavan
1      2   Sanjay
2      3  Deeksha
3      4  Kaushal
4      5    Rucha
5      6      plm
6      7      uhb
7      8      rdc
8      9      esz
9     10      bhi

In [78]:
#9.v.b
df.head()

   empid     Name
0      1    Pavan
1      2   Sanjay
2      3  Deeksha
3      4  Kaushal
4      5    Rucha

In [79]:
#9.v.c
df.tail()

   empid Name
5      6  plm
6      7  uhb
7      8  rdc
8      9  esz
9     10  bhi

In [80]:
#9.v.d
df.head(2)

   empid    Name
0      1   Pavan
1      2  Sanjay

In [81]:
#9.v.d
df.tail(2)

   empid Name
8      9  esz
9     10  bhi

In [82]:
df.columns

Index(['empid', 'Name'], dtype='object')

In [84]:
print("5th employee is : ",df.iloc[4]['Name'])

5th employee is :  plm

In [86]:
print("4th employee is : ",df.iloc[3])

4th employee is :  empid          4
Name     Kaushal
Name: 3, dtype: object

In [87]:
df.to_csv('MyRecords.csv')